# Novibet Case Study Exploratory Data Analysis

In [62]:
#Imports
import pandas as pd
import numpy as np
import datetime

In [63]:
#Data Input
casino_users = pd.read_csv("Casino Users.csv")
customer_wallet = pd.read_csv("Customer Wallet.csv")
casino_games = pd.read_csv("Casino games.csv")

## Casino Users EDA

In [64]:
casino_users.head()

,UserProfileId,BirthDate,ZipCode,CountryName,Sex,Registration Date,City,CountryId,StatusSysname
0,1504977,1991-12-23 00:00:00.000,17342,Greece,M,2021-08-03 07:03:20.000,Athens,1,TEST
1,1258660,1991-07-06 00:00:00.000,15344,Greece,F,2021-01-15 09:03:21.000,pallini,1,TEST
2,1531613,1997-08-18 00:00:00.000,666666,Greece,M,2021-09-14 06:20:33.000,MENIDI,1,TEST
3,1278219,1985-02-01 00:00:00.000,14122,Greece,M,2021-01-28 14:14:02.000,Athens,1,TEST
4,1414194,1990-11-06 00:00:00.000,11636,Greece,M,2021-05-05 12:18:30.000,poli,1,TEST

In [65]:
casino_users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10641 entries, 0 to 10640
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   UserProfileId      10641 non-null  int64
 1   BirthDate          10641 non-null  object
 2   ZipCode            10641 non-null  object
 3   CountryName        10641 non-null  object
 4   Sex                10641 non-null  object
 5   Registration Date  10641 non-null  object
 6   City               10641 non-null  object
 7   CountryId          10641 non-null  int64
 8   StatusSysname      10641 non-null  object
dtypes: int64(2), object(7)
memory usage: 748.3+ KB

In [66]:
casino_users.UserProfileId.value_counts()

1483445    11
1663093    11
1623294    10
1532009     8
1518098     8
           ..
1522853     1
1632122     1
1554598     1
1582137     1
1684717     1
Name: UserProfileId, Length: 6029, dtype: int64

In [67]:
casino_users.BirthDate = pd.to_datetime(casino_users.BirthDate)
casino_users['Registration Date'] = pd.to_datetime(casino_users['Registration Date'])

In [68]:
casino_users.CountryId.value_counts()

1      8177
175    2292
56      153
50        8
24        7
106       2
52        2
Name: CountryId, dtype: int64

In [69]:
casino_users.CountryName.value_counts()

Greece            8177
United Kingdom    2292
Ireland            153
Hungary              8
Finland              7
New Zealand          2
India                2
Name: CountryName, dtype: int64

In [70]:
casino_users.StatusSysname.value_counts()

ACTIVE      10432
TEST          150
INACTIVE       59
Name: StatusSysname, dtype: int64

In [71]:
casino_users.Sex.value_counts()

M    8421
F    2220
Name: Sex, dtype: int64

In [72]:
casino_users.ZipCode.value_counts()

34100      72
30100      55
35100      51
67100      51
42100      50
           ..
R42DE42     1
187 55      1
D07K1W0     1
44001       1
HA3 0SJ     1
Name: ZipCode, Length: 2945, dtype: int64

In [73]:
casino_users.City.value_counts()

Thessaloniki    439
Athina          402
Athens          195
Patra           193
London          167
               ...
Carlisle          1
okehampton        1
Kipseli           1
Dorchester        1
Stauroupoli       1
Name: City, Length: 2109, dtype: int64

In [74]:
casino_users.City = casino_users.City.str.lower()

casino_users.City = casino_users.City.str.replace('α','a')
casino_users.City = casino_users.City.str.replace('β','b')
casino_users.City = casino_users.City.str.replace('γ','g')
casino_users.City = casino_users.City.str.replace('δ','d')
casino_users.City = casino_users.City.str.replace('ε','e')
casino_users.City = casino_users.City.str.replace('ζ','z')
casino_users.City = casino_users.City.str.replace('η','i')
casino_users.City = casino_users.City.str.replace('θ','th')
casino_users.City = casino_users.City.str.replace('ι','i')
casino_users.City = casino_users.City.str.replace('κ','k')
casino_users.City = casino_users.City.str.replace('λ','l')
casino_users.City = casino_users.City.str.replace('μ','m')
casino_users.City = casino_users.City.str.replace('ν','n')
casino_users.City = casino_users.City.str.replace('ξ','x')
casino_users.City = casino_users.City.str.replace('ο','o')
casino_users.City = casino_users.City.str.replace('π','p')
casino_users.City = casino_users.City.str.replace('ρ','r')
casino_users.City = casino_users.City.str.replace('σ','s')
casino_users.City = casino_users.City.str.replace('ς','s')
casino_users.City = casino_users.City.str.replace('τ','t')
casino_users.City = casino_users.City.str.replace('υ','i')
casino_users.City = casino_users.City.str.replace('φ','f')
casino_users.City = casino_users.City.str.replace('χ','ch')
casino_users.City = casino_users.City.str.replace('ψ','ps')
casino_users.City = casino_users.City.str.replace('ω','o')
casino_users.City = casino_users.City.str.replace('ά','a')
casino_users.City = casino_users.City.str.replace('ή','i')
casino_users.City = casino_users.City.str.replace('ί','i')
casino_users.City = casino_users.City.str.replace('ύ','i')
casino_users.City = casino_users.City.str.replace('ό','o')
casino_users.City = casino_users.City.str.replace('ώ','o')

casino_users.City = casino_users.City.str.capitalize()

casino_users.loc[casino_users.CountryName == 'Greece', "City"] = casino_users.loc[casino_users.CountryName == 'Greece',"City"].str.replace('y','i')
casino_users.loc[casino_users.CountryName == 'Greece', "City"] = casino_users.loc[casino_users.CountryName == 'Greece',"City"].str.replace('oi','i')
casino_users.loc[casino_users.CountryName == 'Greece', "City"] = casino_users.loc[casino_users.CountryName == 'Greece',"City"].str.replace('ei','i')

casino_users.loc[casino_users.City == 'Athina', "City"] = 'Athens'
casino_users.loc[casino_users.City == 'Halkida', "City"] = 'Chalkida'
casino_users.loc[casino_users.City == 'Xalkida', "City"] = 'Chalkida'
casino_users.loc[casino_users.City == 'Xania', "City"] = 'Chania'
casino_users.loc[casino_users.City == 'Hania', "City"] = 'Chania'

casino_users.City = casino_users.City.str.capitalize()

casino_users.City.value_counts()

Athens          737
Thessaloniki    529
Patra           236
London          193
Volos           128
               ...
Polidrosos        1
Harlow            1
Southam           1
Creswell          1
Stauroupoli       1
Name: City, Length: 1651, dtype: int64

In [75]:
casino_users[casino_users.duplicated()]

,UserProfileId,BirthDate,ZipCode,CountryName,Sex,Registration Date,City,CountryId,StatusSysname
12,1258660,1991-07-06,15344,Greece,F,2021-01-15 09:03:21,Pallini,1,TEST
17,1269209,1996-05-24,18544,Greece,F,2021-01-22 10:53:41,Piraias,1,TEST
18,1414194,1990-11-06,11636,Greece,M,2021-05-05 12:18:30,Poli,1,TEST
29,1531613,1997-08-18,666666,Greece,M,2021-09-14 06:20:33,Menidi,1,TEST
31,1258660,1991-07-06,15344,Greece,F,2021-01-15 09:03:21,Pallini,1,TEST
...,...,...,...,...,...,...,...,...,...
10571,1535692,1989-07-27,OX169YA,United Kingdom,M,2021-09-18 17:04:38,Banbury,175,ACTIVE
10575,1620187,1959-12-19,Le4 7ps,United Kingdom,F,2021-12-18 12:00:25,Leicester,175,ACTIVE
10576,1504107,1995-09-23,17342,Greece,F,2021-08-01 14:22:04,Agios dimitrios,1,ACTIVE
10579,1644721,1993-08-13,38445,Greece,M,2022-01-07 20:23:41,Volos,1,ACTIVE
10580,1675649,1991-08-16,26334,Greece,F,2022-02-01 22:32:06,Patra,1,ACTIVE

In [76]:
casino_users = casino_users.drop_duplicates()
casino_users

,UserProfileId,BirthDate,ZipCode,CountryName,Sex,Registration Date,City,CountryId,StatusSysname
0,1504977,1991-12-23,17342,Greece,M,2021-08-03 07:03:20,Athens,1,TEST
1,1258660,1991-07-06,15344,Greece,F,2021-01-15 09:03:21,Pallini,1,TEST
2,1531613,1997-08-18,666666,Greece,M,2021-09-14 06:20:33,Menidi,1,TEST
3,1278219,1985-02-01,14122,Greece,M,2021-01-28 14:14:02,Athens,1,TEST
4,1414194,1990-11-06,11636,Greece,M,2021-05-05 12:18:30,Poli,1,TEST
...,...,...,...,...,...,...,...,...,...
10636,1699860,1998-03-17,57200,Greece,M,2022-03-05 14:59:56,Lagkadas,1,INACTIVE
10637,1684717,2000-05-05,118 52,Greece,M,2022-02-14 12:27:20,Athens,1,INACTIVE
10638,1527028,1999-04-18,56430,Greece,F,2021-09-08 13:17:49,Thessaloniki,1,INACTIVE
10639,1515759,1971-11-07,122 44,Greece,F,2021-08-22 08:55:01,Egaleo,1,INACTIVE
10640,1694464,2001-02-20,18120,Greece,M,2022-02-26 06:12:32,Korudallos,1,INACTIVE

In [77]:
casino_users.duplicated().sum()

0

In [78]:
casino_users.CountryId.value_counts()

1      4549
175    1583
56      109
50        7
24        5
106       1
52        1
Name: CountryId, dtype: int64

In [79]:
casino_users.CountryName.value_counts()

Greece            4549
United Kingdom    1583
Ireland            109
Hungary              7
Finland              5
New Zealand          1
India                1
Name: CountryName, dtype: int64

In [80]:
casino_users.StatusSysname.value_counts()

ACTIVE      6128
TEST          68
INACTIVE      59
Name: StatusSysname, dtype: int64

In [81]:
casino_users.City.value_counts()

Athens               426
Thessaloniki         313
Patra                143
London               126
Peristeri             62
                    ...
Chania,crete           1
Hartford               1
Auckland               1
Peristeri, attiki      1
Stauroupoli            1
Name: City, Length: 1651, dtype: int64

In [82]:
def calc_age(born):
    today = datetime.date.today()
    return today.year - born.year - ((today.month, today.day) < (born.month, born.day))

In [83]:
casino_users['Age'] = casino_users['BirthDate'].apply(lambda x: calc_age(x))

In [84]:
today = datetime.date.today()
casino_users['MonthsMember'] = today
casino_users.MonthsMember = pd.to_datetime(casino_users.MonthsMember)
casino_users['MonthsMember'] = ((casino_users.MonthsMember - casino_users['Registration Date'])/np.timedelta64(1, 'M'))
casino_users.MonthsMember = casino_users.MonthsMember.astype(int)
casino_users.head()

,UserProfileId,BirthDate,ZipCode,CountryName,Sex,Registration Date,City,CountryId,StatusSysname,Age,MonthsMember
0,1504977,1991-12-23,17342,Greece,M,2021-08-03 07:03:20,Athens,1,TEST,30,8
1,1258660,1991-07-06,15344,Greece,F,2021-01-15 09:03:21,Pallini,1,TEST,30,14
2,1531613,1997-08-18,666666,Greece,M,2021-09-14 06:20:33,Menidi,1,TEST,24,6
3,1278219,1985-02-01,14122,Greece,M,2021-01-28 14:14:02,Athens,1,TEST,37,14
4,1414194,1990-11-06,11636,Greece,M,2021-05-05 12:18:30,Poli,1,TEST,31,11

In [85]:
casino_users[casino_users.duplicated(['UserProfileId','StatusSysname'], keep=False)].sort_values(by='UserProfileId')

,UserProfileId,BirthDate,ZipCode,CountryName,Sex,Registration Date,City,CountryId,StatusSysname,Age,MonthsMember
8048,1504134,1995-02-15,18757,Greece,M,2021-08-01 15:09:26,Keratsini,1,ACTIVE,27,8
5281,1504134,1995-02-15,18453,Greece,M,2021-08-01 15:09:26,Nikaia,1,ACTIVE,27,8
10100,1504950,1981-12-09,Sr34pf,United Kingdom,M,2021-08-03 02:47:20,Sunderland,175,ACTIVE,40,8
2280,1504950,1981-12-08,Sr34pf,United Kingdom,M,2021-08-03 02:47:20,Sunderland,175,ACTIVE,40,8
3710,1505190,1992-07-03,661 00,Greece,F,2021-08-03 15:10:21,Drama,1,ACTIVE,29,8
...,...,...,...,...,...,...,...,...,...,...,...
8279,1705618,1980-04-24,413 35,Greece,F,2022-03-12 19:24:19,Larisa,1,ACTIVE,41,1
6544,1710135,1969-01-26,621 22,Greece,M,2022-03-20 17:55:31,Serres,1,ACTIVE,53,0
4153,1710135,1969-01-26,621 22,Greece,F,2022-03-20 17:55:31,Serres,1,ACTIVE,53,0
3827,1713940,1979-06-19,18453,Greece,M,2022-03-27 09:56:27,Pireas,1,ACTIVE,42,0
2108,1713940,1979-06-20,18453,Greece,M,2022-03-27 09:56:27,Pireas,1,ACTIVE,42,0

In [86]:
casino_users = casino_users.drop_duplicates(subset=['UserProfileId','StatusSysname'])

In [87]:
casino_users.duplicated(['UserProfileId','StatusSysname']).sum()

0

In [88]:
casino_users[casino_users.duplicated(['UserProfileId'], keep=False)].sort_values(by='UserProfileId')

,UserProfileId,BirthDate,ZipCode,CountryName,Sex,Registration Date,City,CountryId,StatusSysname,Age,MonthsMember
10617,1511267,1985-12-16,546 28,Greece,F,2021-08-14 22:29:16,Thessaloniki,1,INACTIVE,36,7
4146,1511267,1985-12-16,546 28,Greece,F,2021-08-14 22:29:16,Thessaloniki,1,ACTIVE,36,7
10586,1512301,1970-07-11,NN6 7NR,United Kingdom,F,2021-08-16 18:40:59,Northamptonshire,175,INACTIVE,51,7
9807,1512301,1970-07-11,NN6 7NR,United Kingdom,F,2021-08-16 18:40:59,Northamptonshire,175,ACTIVE,51,7
4406,1513148,1974-07-25,58200,Greece,M,2021-08-18 09:08:44,Edessa,1,ACTIVE,47,7
...,...,...,...,...,...,...,...,...,...,...,...
6870,1694464,2001-02-20,18120,Greece,M,2022-02-26 06:12:32,Korudallos,1,ACTIVE,21,1
2053,1699860,1998-03-17,57200,Greece,M,2022-03-05 14:59:56,Lagkadas,1,ACTIVE,24,1
10636,1699860,1998-03-17,57200,Greece,M,2022-03-05 14:59:56,Lagkadas,1,INACTIVE,24,1
10621,1712213,2001-01-31,45221,Greece,F,2022-03-25 10:07:59,Ioannina,1,INACTIVE,21,0
3099,1712213,2001-01-31,45221,Greece,F,2022-03-25 10:07:59,Ioannina,1,ACTIVE,21,0

In [89]:
casino_users = casino_users.drop_duplicates(subset=['UserProfileId'])

In [90]:
casino_users.duplicated(['UserProfileId']).sum()

0

## Customer Wallet Analysis

In [91]:
customer_wallet = pd.read_csv("Customer Wallet.csv")

In [92]:
customer_wallet.head()

,WalletActionId,UserProfileId,Type,TypeSysname,Amount,MethodSysname,Created
0,29220192,1521781,1,DEPOSIT,100.0,DIASDTM,2021-10-10 19:16:58.297
1,29220298,1512213,1,DEPOSIT,10.0,VisaCard,2021-10-10 19:19:03.650
2,29221601,1520026,1,DEPOSIT,3.0,DIASDTM,2021-10-10 19:40:06.510
3,29222108,1550402,1,DEPOSIT,10.0,PSCPaysafeCard,2021-10-10 19:49:03.867
4,29203403,1550060,2,WITHDRAW,-17.5,VisaCard,2021-10-10 19:50:06.037

In [93]:
customer_wallet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38294 entries, 0 to 38293
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   WalletActionId  38294 non-null  int64
 1   UserProfileId   38294 non-null  int64
 2   Type            38294 non-null  int64
 3   TypeSysname     38294 non-null  object
 4   Amount          38294 non-null  float64
 5   MethodSysname   38294 non-null  object
 6   Created         38294 non-null  object
dtypes: float64(1), int64(3), object(3)
memory usage: 2.0+ MB

In [94]:
customer_wallet.Created = pd.to_datetime(customer_wallet.Created)
customer_wallet.head()

In [95]:
customer_wallet = customer_wallet.sort_values(by=['UserProfileId', 'Type', 'Created'])
customer_wallet['Interval'] = customer_wallet.Created.diff().apply(lambda x: x/np.timedelta64(1, 'D'))
mask = customer_wallet[['UserProfileId']] != customer_wallet[['UserProfileId']].shift(1) 
mask1 = customer_wallet[['Type']] != customer_wallet[['Type']].shift(1) 
mask3 = mask.UserProfileId + mask1.Type
customer_wallet.Interval[mask3] = np.nan
customer_wallet.Interval = customer_wallet.Interval.fillna(0).astype(int)
customer_wallet.head()

C:\Users\panos\AppData\Local\Temp/ipykernel_31496/2262511137.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  customer_wallet.Interval[mask3] = np.nan

,WalletActionId,UserProfileId,Type,TypeSysname,Amount,MethodSysname,Created,Interval
22277,27187795,1248186,1,DEPOSIT,30.0,VisaCard,2021-09-09 14:51:01.043,0
25153,27660573,1248186,1,DEPOSIT,20.0,VisaCard,2021-09-16 14:46:47.330,6
25230,27723751,1248186,1,DEPOSIT,30.0,VisaCard,2021-09-17 15:54:32.667,1
27513,28006420,1248186,1,DEPOSIT,30.0,VisaCard,2021-09-22 14:59:03.603,4
22974,27716034,1358038,1,DEPOSIT,10.0,VisaCard,2021-09-17 13:41:52.863,0

In [96]:
customer_wallet.nunique()

WalletActionId    38292
UserProfileId      2392
Type                  2
TypeSysname           2
Amount             1518
MethodSysname        15
Created           38294
Interval             57
dtype: int64

In [97]:
customer_wallet.UserProfileId.value_counts()

1508180    767
1515544    417
1510390    354
1520982    332
1526050    268
          ...
1545894      1
1546122      1
1546163      1
1546216      1
1574252      1
Name: UserProfileId, Length: 2392, dtype: int64

In [98]:
customer_wallet.duplicated().sum()

0

In [99]:
customer_wallet.isnull().sum()

WalletActionId    0
UserProfileId     0
Type              0
TypeSysname       0
Amount            0
MethodSysname     0
Created           0
Interval          0
dtype: int64

In [100]:
customer_wallet.Type.value_counts()

1    33302
2     4992
Name: Type, dtype: int64

In [101]:
customer_wallet.TypeSysname.value_counts()

DEPOSIT     33302
WITHDRAW     4992
Name: TypeSysname, dtype: int64

In [102]:
customer_wallet.MethodSysname.value_counts()

VisaCard          25539
PSCPaysafeCard     6636
DIASDTM            2347
PayPal             1677
Envoy               827
PayPal1Click        510
DIASMyBank          399
Trustly             211
Skrill               42
VivaWallet           36
Skrill1tap           31
RapidTransfer        22
Moneybookers         13
Neteller              3
MoneySafe             1
Name: MethodSysname, dtype: int64

In [103]:
customer_wallet.Amount.describe()

count     38294.000000
mean         56.193454
std        4486.064151
min     -400000.000000
25%          10.000000
50%          10.000000
75%          30.000000
max      200000.000000
Name: Amount, dtype: float64

## Casino Games EDA

In [104]:
casino_games.head()

,Casino_Provider,UserID,IsJackpotWinID,IsFreeSpinID,Date,IsLiveID,Hold
0,Iforium,984532,0,0,2021-09-07,0,185.0
1,Nyx,1531182,0,0,2021-09-29,0,85.1
2,PragmaticPlay,1149364,0,0,2021-09-03,0,243.6
3,PlayNGo,1130140,0,1,2021-10-02,0,-218.4
4,PlayTech,1009509,0,0,2021-09-25,0,-5.4

In [105]:
casino_games.isnull().sum()

Casino_Provider    0
UserID             0
IsJackpotWinID     0
IsFreeSpinID       0
Date               0
IsLiveID           0
Hold               0
dtype: int64

In [106]:
casino_games.nunique()

Casino_Provider         13
UserID              153350
IsJackpotWinID           2
IsFreeSpinID             2
Date                    62
IsLiveID                 2
Hold               1276380
dtype: int64

In [107]:
casino_games.duplicated().sum()

0

In [108]:
casino_games.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9823921 entries, 0 to 9823920
Data columns (total 7 columns):
 #   Column           Dtype
---  ------           -----
 0   Casino_Provider  object
 1   UserID           int64
 2   IsJackpotWinID   int64
 3   IsFreeSpinID     int64
 4   Date             object
 5   IsLiveID         int64
 6   Hold             float64
dtypes: float64(1), int64(4), object(2)
memory usage: 524.7+ MB

In [109]:
casino_games.Casino_Provider.value_counts()

PlayTech           2800617
PlayNGo            1977991
PragmaticPlay      1474608
Nyx                 946275
NetEnt              861109
Iforium             846699
RedTiger            604913
Skywind             138956
Evolution           117923
Oryx                 30383
MicroGaming          17369
Edict                 4974
EvolutionDirect       2104
Name: Casino_Provider, dtype: int64

In [110]:
casino_games.IsJackpotWinID.value_counts()

0    9823273
1        648
Name: IsJackpotWinID, dtype: int64

In [111]:
casino_games.IsFreeSpinID.value_counts()

0    5440719
1    4383202
Name: IsFreeSpinID, dtype: int64

In [112]:
casino_games.IsLiveID.value_counts()

0    9153258
1     670663
Name: IsLiveID, dtype: int64

In [113]:
casino_games.Hold.describe()

count    9.823921e+06
mean     7.459068e+01
std      1.040730e+04
min     -1.869985e+07
25%     -1.710000e+01
50%     -1.500000e+00
75%      4.768000e+01
max      1.617226e+07
Name: Hold, dtype: float64